### [참고] <a href="https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf">Pandas Cheat Sheet</a>

### groupby

<img src='https://www.w3resource.com/w3r_images/pandas-groupby-split-apply-combine.svg'>

- 데이터 그룹 연산 수행 단계
    - 원본 데이터 셋을 그룹별로 분할(split)
    - 분할된 각 그룹에 함수 적용
    - 결과 통합

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

### [실습1]

In [2]:
mpg_df = sns.load_dataset("mpg")
mpg_df.head(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite

In [3]:
mpg_df.groupby('origin').size()

origin
europe     70
japan      79
usa       249
dtype: int64

In [6]:
mpg_df['origin'].value_counts()

usa       249
japan      79
europe     70
Name: origin, dtype: int64

In [9]:
mpg_df.groupby('origin')['horsepower'].mean()

origin
europe     80.558824
japan      79.835443
usa       119.048980
Name: horsepower, dtype: float64

In [10]:
mpg_df.groupby(['model_year', 'origin']).mean()

                         mpg  cylinders  displacement  horsepower  \
model_year origin
70         europe  25.200000   4.000000    107.800000   86.200000
           japan   25.500000   4.000000    105.000000   91.500000
           usa     15.272727   7.636364    336.909091  166.954545
71         europe  28.750000   4.000000     95.000000   74.000000
           japan   29.500000   4.000000     88.250000   79.250000
           usa     18.100000   6.200000    257.000000  119.842105
72         europe  22.000000   4.000000    111.000000   79.600000
           japan   24.200000   3.800000     99.400000   93.800000
           usa     16.277778   6.888889    281.250000  138.777778
73         europe  24.000000   4.000000    105.000000   81.857143
           japan   20.000000   4.250000    107.750000   98.500000
           usa     15.034483   7.241379    314.103448  146.620690
74         europe  27.000000   4.000000     93.166667   74.166667
           japan   29.333333   4.000000     89.500000   72.500000
           usa     18.333333   6.266667    236.066667  112.142857
75         europe  24.500000   4.000000    109.500000   89.500000
           japan   27.500000   4.000000    110.250000   80.250000
           usa     17.550000   6.400000    253.400000  108.700000
76         europe  24.250000   4.250000    116.125000   87.625000
           japan   28.000000   4.500000    107.250000   76.500000
           usa     19.431818   6.363636    243.954545  110.500000
77         europe  29.250000   4.000000     98.500000   81.000000
           japan   27.416667   4.166667    100.500000   81.166667
           usa     20.722222   6.222222    242.333333  118.388889
78         europe  24.950000   4.833333    126.166667   99.166667
           japan   29.687500   4.000000    107.250000   79.250000
           usa     21.772727   6.000000    217.545455  107.272727
79         europe  30.450000   4.250000    126.000000   72.000000
           japan   32.950000   4.000000     85.500000   65.000000
           usa     23.478261   6.260870    231.260870  109.434783
80         europe  37.288889   4.111111    104.222222   66.750000
           japan   35.400000   4.076923    104.615385   78.846154
           usa     25.914286   4.285714    151.571429   88.833333
81         europe  31.575000   4.500000    122.750000   76.666667
           japan   32.958333   4.333333    107.500000   78.333333
           usa     27.530769   4.923077    164.846154   84.538462
82         europe  40.000000   4.000000    101.000000   63.000000
           japan   34.888889   4.000000    103.777778   74.000000
           usa     29.450000   4.300000    142.950000   86.947368

                        weight  acceleration
model_year origin
70         europe  2309.200000     16.500000
           japan   2251.000000     14.750000
           usa     3716.500000     11.977273
71         europe  2024.000000     16.750000
           japan   1936.000000     16.375000
           usa     3401.600000     14.575000
72         europe  2573.200000     18.700000
           japan   2300.400000     15.400000
           usa     3682.666667     14.055556
73         europe  2335.714286     16.428571
           japan   2397.250000     15.625000
           usa     3821.448276     13.620690
74         europe  2139.333333     15.333333
           japan   2053.000000     17.666667
           usa     3503.333333     15.966667
75         europe  2571.166667     15.083333
           japan   2303.250000     16.000000
           usa     3533.200000     16.350000
76         europe  2611.000000     16.050000
           japan   2217.500000     16.575000
           usa     3405.409091     15.786364
77         europe  2138.750000     15.000000
           japan   2295.833333     16.316667
           usa     3422.000000     15.238889
78         europe  2691.666667     16.233333
           japan   2221.250000     16.200000
           usa     3141.136364     15.545455
79         europe  2693.750000     18.400000
           japan   1997.500000     17.200000
           usa     3210.217391     15.243478
80         europe  2348.000000     18.366667
           japan   2290.307692     16.015385
           usa     2822.428571     16.800000
81         europe  2725.000000     17.500000
           japan   2269.166667     16.183333
           usa     2695.000000     16.053846
82         europe  2055.000000     19.950000
           japan   2132.777778     15.833333
           usa     2637.750000     16.670000

### [실습2]

In [11]:
df = pd.DataFrame({
    'A' : ['ha', 'hi', 'ho', 'ha', 'ho'],
    'B' : ['one', 'two', 'one', 'one', 'two'],
    'Data1' : np.random.randn(5),
    'Data2' : np.random.randn(5)
})
df

    A    B     Data1     Data2
0  ha  one -0.941769  0.831255
1  hi  two  0.943136  0.539449
2  ho  one  1.722525 -0.578782
3  ha  one  0.316576 -1.200093
4  ho  two -0.142704  0.929201

In [12]:
df.groupby('A').sum()

       Data1     Data2
A
ha -0.625193 -0.368838
hi  0.943136  0.539449
ho  1.579821  0.350419

In [13]:
df.groupby('B').mean()

        Data1     Data2
B
one  0.365777 -0.315873
two  0.400216  0.734325

In [15]:
df.groupby('A').agg([np.sum, np.mean, np.std]) # agg = aggregate ( 축약해서 사용, 함수의 동작은 같음 )

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_15904\3675415188.py:1: FutureWarning: ['B'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.groupby('A').agg([np.sum, np.mean, np.std]) # agg = aggregate ( 축약해서 사용, 함수의 동작은 같음 )

       Data1                         Data2
         sum      mean       std       sum      mean       std
A
ha -0.625193 -0.312596  0.889784 -0.368838 -0.184419  1.436380
hi  0.943136  0.943136       NaN  0.539449  0.539449       NaN
ho  1.579821  0.789911  1.318915  0.350419  0.175210  1.066305

In [17]:
df.groupby('A')["Data1"].agg([np.sum, np.mean, np.std]).rename(columns={'sum':'합계', 'mean':'평균', 'std':'표준편차'})

          합계        평균      표준편차
A
ha -0.625193 -0.312596  0.889784
hi  0.943136  0.943136       NaN
ho  1.579821  0.789911  1.318915

### [실습3]

In [18]:
student_list = {
    "name" : ["John", "Nate", "Abraham", "Brian", "Janny", "Yuna", "Jeniffer", "Edward", "Zara", "Wendy", "Sera"],
    "major" : ["Computer Science", "Computer Science", "Physics", "Psychology", "Economics", "Economics", "Computer Science", "Computer Science", "Psychology", "Economics", "Psychology"],
    "gender" : ["male", "male", "male", "male", "female", "female", "female", "male", "female", "female", "female"]
}
df = pd.DataFrame(student_list)
df

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [19]:
df.groupby('major').size()

major
Computer Science    4
Economics           3
Physics             1
Psychology          3
dtype: int64

In [20]:
major_df = pd.DataFrame({'count':df.groupby('major').size()})
major_df

                  count
major
Computer Science      4
Economics             3
Physics               1
Psychology            3

In [21]:
major_df.reset_index()

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [25]:
groupby_gender = df.groupby('gender')
groupby_gender.groups

{'female': [4, 5, 6, 8, 9, 10], 'male': [0, 1, 2, 3, 7]}

In [28]:
for name, group in groupby_gender:
    print(name + " : " + str(len(group)))
    print(group)

female : 6
        name             major  gender
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
male : 5
      name             major gender
0     John  Computer Science   male
1     Nate  Computer Science   male
2  Abraham           Physics   male
3    Brian        Psychology   male
7   Edward  Computer Science   male

---

## [추가실습] 
> * car_sales.xlsx 파일을 데이터 프레임으로 생성

In [29]:
car_df = pd.read_excel("../data/car_sales.xlsx")
car_df

    Branch  Car Name  Quantity  Unit Price  Ext Price
0  Yeonnam  Grandeur         7          35        245
1  Yeonnam    Sonata        11          20        220
2  Yeonnam    Avante         3          15         45
3  Sungsan  Grandeur         5          36        180
4  Sungsan    Sonata        19          19        361
5  Sungsan    Avante         9          14        126
6   Yeonhi  Grandeur        10          34        340
7   Yeonhi    Sonata        13          19        247
8   Yeonhi    Avante        15          13        195

> Branch 별 매출액 구하기

In [32]:
car_df.groupby("Branch")["Ext Price"].sum()

Branch
Sungsan    667
Yeonhi     782
Yeonnam    510
Name: Ext Price, dtype: int64

> 구한 매출액 결과를 데이터 프레임으로 생성

In [45]:
ext_df = pd.DataFrame({"Total":car_df.groupby("Branch")["Ext Price"].sum()})
ext_df.reset_index(0)

    Branch  Total
0  Sungsan    667
1   Yeonhi    782
2  Yeonnam    510

In [46]:
car_df.groupby("Branch")["Ext Price"].sum().rename("Total").reset_index()

    Branch  Total
0  Sungsan    667
1   Yeonhi    782
2  Yeonnam    510

In [51]:
df_m = pd.merge(car_df, ext_df, how="left", on="Branch")
df_m

    Branch  Car Name  Quantity  Unit Price  Ext Price  Total
0  Yeonnam  Grandeur         7          35        245    510
1  Yeonnam    Sonata        11          20        220    510
2  Yeonnam    Avante         3          15         45    510
3  Sungsan  Grandeur         5          36        180    667
4  Sungsan    Sonata        19          19        361    667
5  Sungsan    Avante         9          14        126    667
6   Yeonhi  Grandeur        10          34        340    782
7   Yeonhi    Sonata        13          19        247    782
8   Yeonhi    Avante        15          13        195    782

In [52]:
df_m['Br_Pct'] = df_m['Ext Price'] / df_m['Total']
df_m

    Branch  Car Name  Quantity  Unit Price  Ext Price  Total    Br_Pct
0  Yeonnam  Grandeur         7          35        245    510  0.480392
1  Yeonnam    Sonata        11          20        220    510  0.431373
2  Yeonnam    Avante         3          15         45    510  0.088235
3  Sungsan  Grandeur         5          36        180    667  0.269865
4  Sungsan    Sonata        19          19        361    667  0.541229
5  Sungsan    Avante         9          14        126    667  0.188906
6   Yeonhi  Grandeur        10          34        340    782  0.434783
7   Yeonhi    Sonata        13          19        247    782  0.315857
8   Yeonhi    Avante        15          13        195    782  0.249361

### transform()

In [53]:
car_df.groupby("Branch")["Ext Price"].transform('sum')

0    510
1    510
2    510
3    667
4    667
5    667
6    782
7    782
8    782
Name: Ext Price, dtype: int64

In [56]:
car_df['Br_Total'] = car_df.groupby("Branch")["Ext Price"].transform('sum')
car_df['Br_Pct'] = car_df['Ext Price'] / car_df['Br_Total']
car_df

    Branch  Car Name  Quantity  Unit Price  Ext Price  Br_Total    Br_Pct
0  Yeonnam  Grandeur         7          35        245       510  0.480392
1  Yeonnam    Sonata        11          20        220       510  0.431373
2  Yeonnam    Avante         3          15         45       510  0.088235
3  Sungsan  Grandeur         5          36        180       667  0.269865
4  Sungsan    Sonata        19          19        361       667  0.541229
5  Sungsan    Avante         9          14        126       667  0.188906
6   Yeonhi  Grandeur        10          34        340       782  0.434783
7   Yeonhi    Sonata        13          19        247       782  0.315857
8   Yeonhi    Avante        15          13        195       782  0.249361

### [실습4]

In [58]:
df = pd.DataFrame({
    'School' : ['Yeonhi', 'Yeonhi', 'Sungsan', 'Sungsan', 'Sungsan'],
    'Name' : ['Haena', 'Gisu','Una', 'Naeun', 'Ziho'],
    'Math_s' : [92,70,88,92,70]
})
df

    School   Name  Math_s
0   Yeonhi  Haena      92
1   Yeonhi   Gisu      70
2  Sungsan    Una      88
3  Sungsan  Naeun      92
4  Sungsan   Ziho      70

In [61]:
# Avg_s 컬럼 생성 후 학교별 평균점수 보여주기
df['Avg_s'] = df.groupby('School')['Math_s'].transform('mean')
df

    School   Name  Math_s      Avg_s
0   Yeonhi  Haena      92  81.000000
1   Yeonhi   Gisu      70  81.000000
2  Sungsan    Una      88  83.333333
3  Sungsan  Naeun      92  83.333333
4  Sungsan   Ziho      70  83.333333

In [62]:
# 점수별 등급 부여 >= 90 A, >= 80 B, >= 70 C, F (함수)
def get_grade(score):
    if score >= 90:
        return 'A'
    elif score >= 80:
        return 'B'
    elif score >= 70:
        return 'C'
    else :
        return 'F'

In [63]:
df['Grade'] = df['Math_s'].apply(get_grade)
df

    School   Name  Math_s      Avg_s Grade
0   Yeonhi  Haena      92  81.000000     A
1   Yeonhi   Gisu      70  81.000000     C
2  Sungsan    Una      88  83.333333     B
3  Sungsan  Naeun      92  83.333333     A
4  Sungsan   Ziho      70  83.333333     C

In [64]:
def sort_math(df, n=3, column='Math_s'):
    return df.sort_values(column)[:n]

In [65]:
df.groupby('School').apply(sort_math, n=2)

            School   Name  Math_s      Avg_s Grade
School
Sungsan 4  Sungsan   Ziho      70  83.333333     C
        2  Sungsan    Una      88  83.333333     B
Yeonhi  1   Yeonhi   Gisu      70  81.000000     C
        0   Yeonhi  Haena      92  81.000000     A